/*0. Напишите программу, которая на вход принимает число и выдаёт его квадрат (число умноженное на само себя). */

System.Console.WriteLine("Введите число: ");
int userNumder = Convert.ToInt32(Console.ReadLine());
int square = userNumder * userNumder;
System.Console.WriteLine(square);


