/*09 Напишите программу, которая выводит случайное число из отрезка [10, 99] и показывает наибольшую цифру числа.*/

Console.Clear();
int number = new Random(). Next(10, 99);
System.Console.WriteLine(number);


